appbench/apps/RocksDB/NVME-RESULT/fillrandom-readrandom_4_4096.txt
RocksDB:    version 5.4
Date:       Sat Jan 11 17:18:15 2020
CPU:        64 * Intel(R) Xeon(R) Gold 5218 CPU @ 2.30GHz
CPUCache:   22528 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     4096 bytes each (2048 bytes after compression)
Entries:    500000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    1962.7 MB (estimated)
FileSize:   986.1 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
DB path: [/localhome/sudarsun/fsoffload/appbench/RocksDB/DELME]
fillrandom   :      24.082 micros/op 41524 ops/sec;  163.0 MB/s
DB path: [/localhome/sudarsun/fsoffload/appbench/RocksDB/DELME]
readrandom   :       2.182 micros/op 458247 ops/sec; 1798.8 MB/s (500000 of 500000 found)