appbench/apps/RocksDB/NVME-RESULT/fillrandom-readrandom_4_512.txt
RocksDB:    version 5.4
Date:       Sat Jan 11 17:16:08 2020
CPU:        64 * Intel(R) Xeon(R) Gold 5218 CPU @ 2.30GHz
CPUCache:   22528 KB
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Keys:       20 bytes each
Values:     512 bytes each (256 bytes after compression)
Entries:    500000
Prefix:    20 bytes
Keys per prefix:    0
RawSize:    253.7 MB (estimated)
FileSize:   131.6 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Memtablerep: prefix_hash
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
DB path: [/localhome/sudarsun/fsoffload/appbench/RocksDB/DELME]
fillrandom   :       5.286 micros/op 189190 ops/sec;   96.0 MB/s
DB path: [/localhome/sudarsun/fsoffload/appbench/RocksDB/DELME]
readrandom   :       1.204 micros/op 830622 ops/sec;  421.4 MB/s (500000 of 500000 found)